#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_subnet.public[1]: Refreshing state... [id=subnet-0ebb12f7380a42c96]
aws_route.private-route[1]: Refreshing state... [id=r-rtb-0296ccfd581098bfd1080289494]
aws_route.private-route[2]: Refreshing state... [id=r-rtb-0356b547e0c68a6131080289494]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-033c73940b874101a]
aws_route_table.private[0]: Refreshing state... [id=rtb-05ec30982de9b5be4]
aws_route_table.public: Refreshing state... [id=rtb-0681aaca18890709c]
aws_security_group.asg_lb_security_group: Refreshing state... [id=sg-029d54e0d848241ee]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b2717fa2fb83ae22]
aws_subnet.public[0]: Refreshing state... [id=subnet-029ccaae27cefcf15]
aws_route_table.private[1]: Refreshing state... [id=rtb-0296ccfd581098bfd]
aws_route_table.private[2]: Refreshing state... [id=rtb-0356b547e0c68a613]
aws_subnet.public[2]: Refreshing state... [id=subnet-04d0a13df56589d20]
aws_security_group.ec2_security_group: Refreshing state... [id=sg-01c77c00bd0cb8eff]
aws_nat_gateway.private[1]: Refreshing state... [id=nat-08181c92009702f60]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0ce27c92a687d30a3]
aws_nat_gateway.private[0]: Refreshing state... [id=nat-0dbfb13075aae16de]
aws_nat_gateway.private[2]: Refreshing state... [id=nat-023233b73a4a63e76]
aws_route.private-route[0]: Refreshing state... [id=r-rtb-05ec30982de9b5be41080289494]
data.aws_iam_policy_document.assume_role: Reading...
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3760307347]
data.aws_ami.amazon_ami: Reading...
data.aws_iam_policy_document.vpc_flowlog_policy: Reading...
data.aws_iam_policy_document.vpc_flowlog_policy: Read complete after 0s [id=3442509011]
aws_vpc.this: Refreshing state... [id=vpc-05fd8fb92d2545f6d]
aws_cloudwatch_log_group.cw_loggroup: Refreshing state... [id=example-1]
aws_iam_role.vpc_flowlog_role: Refreshing state... [id=vpc_flowlog_role]
data.aws_ami.amazon_ami: Read complete after 0s [id=ami-07251f912d2a831a3]
aws_lb_target_group.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4]
aws_subnet.private[0]: Refreshing state... [id=subnet-095187fc19e4faf22]
aws_subnet.private[1]: Refreshing state... [id=subnet-0bc3d45b2068a556a]
aws_subnet.private[2]: Refreshing state... [id=subnet-05de33583a52d0de4]
aws_internet_gateway.this-igw: Refreshing state... [id=igw-064856131dcb8f60b]
aws_route.internet-route: Refreshing state... [id=r-rtb-0681aaca18890709c1080289494]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ecd1eea6d8520450]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-08528e8149253c7b2]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-041b93a6e67d1bf98]
aws_lb.front: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/front/6d3323a2eb5b7107]
aws_instance.app-server[1]: Refreshing state... [id=i-0ed4dc47216c1990d]
aws_instance.app-server[0]: Refreshing state... [id=i-0a735eee89ef9632e]
aws_instance.app-server[2]: Refreshing state... [id=i-05cf2f1c8f4128c0a]
aws_iam_role_policy.vpc_flowlog_role: Refreshing state... [id=vpc_flowlog_role:vpc_flowlog_role]
aws_flow_log.app1: Refreshing state... [id=fl-023859572268e7660]
aws_lb_listener.front_end: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/front/6d3323a2eb5b7107/e26a31bfe934a36e]
aws_lb_target_group_attachment.attach-app1[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4-20230714223010063100000001]
aws_lb_target_group_attachment.attach-app1[1]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4-20230714223010207000000002]
aws_lb_target_group_attachment.attach-app1[2]: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4-20230714223010270000000003]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.cw_loggroup must be replaced
-/+ resource "aws_cloudwatch_log_group" "cw_loggroup" {
      ~ arn               = "arn:aws:logs:us-east-2:743794601996:log-group:example-1" -> (known after apply)
      ~ id                = "example-1" -> (known after apply)
      ~ name              = "example-1" -> "example" # forces replacement
      - tags              = {} -> null
      ~ tags_all          = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_flow_log.app1 must be replaced
-/+ resource "aws_flow_log" "app1" {
      ~ arn                      = "arn:aws:ec2:us-east-2:743794601996:vpc-flow-log/fl-023859572268e7660" -> (known after apply)
      ~ id                       = "fl-023859572268e7660" -> (known after apply)
      ~ log_destination          = "arn:aws:logs:us-east-2:743794601996:log-group:example-1" # forces replacement -> (known after apply) # forces replacement
      ~ log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> (known after apply)
      ~ log_group_name           = "example-1" -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
      ~ vpc_id                   = "vpc-05fd8fb92d2545f6d" # forces replacement -> (known after apply) # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_instance.app-server[0] must be replaced
-/+ resource "aws_instance" "app-server" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:743794601996:instance/i-0a735eee89ef9632e" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "us-east-2a" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0a735eee89ef9632e" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-0c2c9589dbbbd379e" -> (known after apply)
      ~ private_dns                          = "ip-10-20-20-20.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.20.20.20" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ subnet_id                            = "subnet-095187fc19e4faf22" # forces replacement -> (known after apply) # forces replacement
        tags                                 = {
            "Name" = "app-server-1"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "f8c969d3cfc2ce542bf59b5c0eaf7a583743503c" -> "9ea6f797c2878361f94d9f508aad35b4b4039b50"
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-029d54e0d848241ee",
        ] -> (known after apply)
        # (6 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0ac2d6b32a1294d02" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.app-server[1] must be replaced
-/+ resource "aws_instance" "app-server" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:743794601996:instance/i-0ed4dc47216c1990d" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "us-east-2b" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-0ed4dc47216c1990d" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-077fdd0ba8acf2d0e" -> (known after apply)
      ~ private_dns                          = "ip-10-20-20-52.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.20.20.52" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ subnet_id                            = "subnet-0bc3d45b2068a556a" # forces replacement -> (known after apply) # forces replacement
        tags                                 = {
            "Name" = "app-server-2"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "f8c969d3cfc2ce542bf59b5c0eaf7a583743503c" -> "9ea6f797c2878361f94d9f508aad35b4b4039b50"
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-029d54e0d848241ee",
        ] -> (known after apply)
        # (6 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-02ccf0fc2ee344394" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_instance.app-server[2] must be replaced
-/+ resource "aws_instance" "app-server" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:743794601996:instance/i-05cf2f1c8f4128c0a" -> (known after apply)
      ~ associate_public_ip_address          = false -> true # forces replacement
      ~ availability_zone                    = "us-east-2c" -> (known after apply)
      ~ cpu_core_count                       = 1 -> (known after apply)
      ~ cpu_threads_per_core                 = 1 -> (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      - hibernation                          = false -> null
      + host_id                              = (known after apply)
      ~ id                                   = "i-05cf2f1c8f4128c0a" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      + key_name                             = (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      ~ primary_network_interface_id         = "eni-05741a17a6791fafc" -> (known after apply)
      ~ private_dns                          = "ip-10-20-20-68.us-east-2.compute.internal" -> (known after apply)
      ~ private_ip                           = "10.20.20.68" -> (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      ~ subnet_id                            = "subnet-05de33583a52d0de4" # forces replacement -> (known after apply) # forces replacement
        tags                                 = {
            "Name" = "app-server-3"
        }
      ~ tenancy                              = "default" -> (known after apply)
      ~ user_data                            = "f8c969d3cfc2ce542bf59b5c0eaf7a583743503c" -> "9ea6f797c2878361f94d9f508aad35b4b4039b50"
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [
          - "sg-029d54e0d848241ee",
        ] -> (known after apply)
        # (6 unchanged attributes hidden)

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/xvda" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0d62bbc532d041795" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_internet_gateway.this-igw will be updated in-place
  ~ resource "aws_internet_gateway" "this-igw" {
        id       = "igw-064856131dcb8f60b"
      ~ tags     = {
          ~ "Name" = "app-1-gateway" -> "Application-1-gateway"
        }
      ~ tags_all = {
          ~ "Name" = "app-1-gateway" -> "Application-1-gateway"
        }
      ~ vpc_id   = "vpc-05fd8fb92d2545f6d" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_lb.front will be updated in-place
  ~ resource "aws_lb" "front" {
        id                               = "arn:aws:elasticloadbalancing:us-east-2:743794601996:loadbalancer/app/front/6d3323a2eb5b7107"
        name                             = "front"
      ~ security_groups                  = [
          - "sg-029d54e0d848241ee",
        ] -> (known after apply)
      ~ subnets                          = [
          - "subnet-029ccaae27cefcf15",
          - "subnet-04d0a13df56589d20",
          - "subnet-0ebb12f7380a42c96",
        ] -> (known after apply)
        tags                             = {
            "Environment" = "front"
        }
        # (16 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_lb_listener.front_end will be updated in-place
  ~ resource "aws_lb_listener" "front_end" {
        id                = "arn:aws:elasticloadbalancing:us-east-2:743794601996:listener/app/front/6d3323a2eb5b7107/e26a31bfe934a36e"
        tags              = {}
        # (5 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4" -> (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # aws_lb_target_group.front must be replaced
-/+ resource "aws_lb_target_group" "front" {
      ~ arn                                = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4" -> (known after apply)
      ~ arn_suffix                         = "targetgroup/application-front/7a387fddd38871d4" -> (known after apply)
      ~ id                                 = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4" -> (known after apply)
      ~ load_balancing_algorithm_type      = "round_robin" -> (known after apply)
        name                               = "application-front"
      + preserve_client_ip                 = (known after apply)
      ~ protocol_version                   = "HTTP1" -> (known after apply)
      - tags                               = {} -> null
      ~ tags_all                           = {} -> (known after apply)
      ~ vpc_id                             = "vpc-05fd8fb92d2545f6d" # forces replacement -> (known after apply) # forces replacement
        # (8 unchanged attributes hidden)

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
        }

        # (1 unchanged block hidden)
    }

  # aws_lb_target_group_attachment.attach-app1[0] must be replaced
-/+ resource "aws_lb_target_group_attachment" "attach-app1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4-20230714223010063100000001" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4" # forces replacement -> (known after apply) # forces replacement
      ~ target_id        = "i-0a735eee89ef9632e" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.attach-app1[1] must be replaced
-/+ resource "aws_lb_target_group_attachment" "attach-app1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4-20230714223010207000000002" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4" # forces replacement -> (known after apply) # forces replacement
      ~ target_id        = "i-0ed4dc47216c1990d" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_lb_target_group_attachment.attach-app1[2] must be replaced
-/+ resource "aws_lb_target_group_attachment" "attach-app1" {
      ~ id               = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4-20230714223010270000000003" -> (known after apply)
      ~ target_group_arn = "arn:aws:elasticloadbalancing:us-east-2:743794601996:targetgroup/application-front/7a387fddd38871d4" # forces replacement -> (known after apply) # forces replacement
      ~ target_id        = "i-05cf2f1c8f4128c0a" # forces replacement -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_nat_gateway.private[0] will be destroyed
  # (because aws_nat_gateway.private is not in configuration)
  - resource "aws_nat_gateway" "private" {
      - connectivity_type    = "private" -> null
      - id                   = "nat-0dbfb13075aae16de" -> null
      - network_interface_id = "eni-04f1270c721d4cddf" -> null
      - private_ip           = "10.20.20.5" -> null
      - subnet_id            = "subnet-095187fc19e4faf22" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
    }

  # aws_nat_gateway.private[1] will be destroyed
  # (because aws_nat_gateway.private is not in configuration)
  - resource "aws_nat_gateway" "private" {
      - connectivity_type    = "private" -> null
      - id                   = "nat-08181c92009702f60" -> null
      - network_interface_id = "eni-0cfa675893476db29" -> null
      - private_ip           = "10.20.20.59" -> null
      - subnet_id            = "subnet-0bc3d45b2068a556a" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
    }

  # aws_nat_gateway.private[2] will be destroyed
  # (because aws_nat_gateway.private is not in configuration)
  - resource "aws_nat_gateway" "private" {
      - connectivity_type    = "private" -> null
      - id                   = "nat-023233b73a4a63e76" -> null
      - network_interface_id = "eni-005d5788a442c861d" -> null
      - private_ip           = "10.20.20.88" -> null
      - subnet_id            = "subnet-05de33583a52d0de4" -> null
      - tags                 = {} -> null
      - tags_all             = {} -> null
    }

  # aws_route.internet-route must be replaced
-/+ resource "aws_route" "internet-route" {
      ~ id                     = "r-rtb-0681aaca18890709c1080289494" -> (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      ~ origin                 = "CreateRoute" -> (known after apply)
      ~ route_table_id         = "rtb-0681aaca18890709c" # forces replacement -> (known after apply) # forces replacement
      ~ state                  = "active" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_route.private-route[0] will be destroyed
  # (because aws_route.private-route is not in configuration)
  - resource "aws_route" "private-route" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-05ec30982de9b5be41080289494" -> null
      - nat_gateway_id         = "nat-0dbfb13075aae16de" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-05ec30982de9b5be4" -> null
      - state                  = "active" -> null
    }

  # aws_route.private-route[1] will be destroyed
  # (because aws_route.private-route is not in configuration)
  - resource "aws_route" "private-route" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0296ccfd581098bfd1080289494" -> null
      - nat_gateway_id         = "nat-08181c92009702f60" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0296ccfd581098bfd" -> null
      - state                  = "active" -> null
    }

  # aws_route.private-route[2] will be destroyed
  # (because aws_route.private-route is not in configuration)
  - resource "aws_route" "private-route" {
      - destination_cidr_block = "0.0.0.0/0" -> null
      - id                     = "r-rtb-0356b547e0c68a6131080289494" -> null
      - nat_gateway_id         = "nat-023233b73a4a63e76" -> null
      - origin                 = "CreateRoute" -> null
      - route_table_id         = "rtb-0356b547e0c68a613" -> null
      - state                  = "active" -> null
    }

  # aws_route_table.private[0] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-2:743794601996:route-table/rtb-05ec30982de9b5be4" -> null
      - id               = "rtb-05ec30982de9b5be4" -> null
      - owner_id         = "743794601996" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0dbfb13075aae16de"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "app-1-private-1"
        } -> null
      - tags_all         = {
          - "Name" = "app-1-private-1"
        } -> null
      - vpc_id           = "vpc-05fd8fb92d2545f6d" -> null
    }

  # aws_route_table.private[1] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-2:743794601996:route-table/rtb-0296ccfd581098bfd" -> null
      - id               = "rtb-0296ccfd581098bfd" -> null
      - owner_id         = "743794601996" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-08181c92009702f60"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "app-1-private-2"
        } -> null
      - tags_all         = {
          - "Name" = "app-1-private-2"
        } -> null
      - vpc_id           = "vpc-05fd8fb92d2545f6d" -> null
    }

  # aws_route_table.private[2] will be destroyed
  # (because aws_route_table.private is not in configuration)
  - resource "aws_route_table" "private" {
      - arn              = "arn:aws:ec2:us-east-2:743794601996:route-table/rtb-0356b547e0c68a613" -> null
      - id               = "rtb-0356b547e0c68a613" -> null
      - owner_id         = "743794601996" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-023233b73a4a63e76"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "app-1-private-3"
        } -> null
      - tags_all         = {
          - "Name" = "app-1-private-3"
        } -> null
      - vpc_id           = "vpc-05fd8fb92d2545f6d" -> null
    }

  # aws_route_table.public will be destroyed
  # (because aws_route_table.public is not in configuration)
  - resource "aws_route_table" "public" {
      - arn              = "arn:aws:ec2:us-east-2:743794601996:route-table/rtb-0681aaca18890709c" -> null
      - id               = "rtb-0681aaca18890709c" -> null
      - owner_id         = "743794601996" -> null
      - propagating_vgws = [] -> null
      - route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = "igw-064856131dcb8f60b"
              - instance_id                = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = ""
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
        ] -> null
      - tags             = {
          - "Name" = "app-1-public"
        } -> null
      - tags_all         = {
          - "Name" = "app-1-public"
        } -> null
      - vpc_id           = "vpc-05fd8fb92d2545f6d" -> null
    }

  # aws_route_table.this-rt will be created
  + resource "aws_route_table" "this-rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "Application-1-route-table"
        }
      + tags_all         = {
          + "Name" = "Application-1-route-table"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private[0] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-041b93a6e67d1bf98" -> (known after apply)
      ~ route_table_id = "rtb-05ec30982de9b5be4" -> (known after apply)
      ~ subnet_id      = "subnet-095187fc19e4faf22" # forces replacement -> (known after apply) # forces replacement
    }

  # aws_route_table_association.private[1] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-0ecd1eea6d8520450" -> (known after apply)
      ~ route_table_id = "rtb-0296ccfd581098bfd" -> (known after apply)
      ~ subnet_id      = "subnet-0bc3d45b2068a556a" # forces replacement -> (known after apply) # forces replacement
    }

  # aws_route_table_association.private[2] must be replaced
-/+ resource "aws_route_table_association" "private" {
      ~ id             = "rtbassoc-08528e8149253c7b2" -> (known after apply)
      ~ route_table_id = "rtb-0356b547e0c68a613" -> (known after apply)
      ~ subnet_id      = "subnet-05de33583a52d0de4" # forces replacement -> (known after apply) # forces replacement
    }

  # aws_route_table_association.public[0] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0ce27c92a687d30a3" -> null
      - route_table_id = "rtb-0681aaca18890709c" -> null
      - subnet_id      = "subnet-029ccaae27cefcf15" -> null
    }

  # aws_route_table_association.public[1] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-033c73940b874101a" -> null
      - route_table_id = "rtb-0681aaca18890709c" -> null
      - subnet_id      = "subnet-0ebb12f7380a42c96" -> null
    }

  # aws_route_table_association.public[2] will be destroyed
  # (because aws_route_table_association.public is not in configuration)
  - resource "aws_route_table_association" "public" {
      - id             = "rtbassoc-0b2717fa2fb83ae22" -> null
      - route_table_id = "rtb-0681aaca18890709c" -> null
      - subnet_id      = "subnet-04d0a13df56589d20" -> null
    }

  # aws_security_group.asg_lb_security_group will be destroyed
  # (because aws_security_group.asg_lb_security_group is not in configuration)
  - resource "aws_security_group" "asg_lb_security_group" {
      - arn                    = "arn:aws:ec2:us-east-2:743794601996:security-group/sg-029d54e0d848241ee" -> null
      - description            = "Allow inbound and outbound traffic to load balancer from the internet." -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-029d54e0d848241ee" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "ASG-LB-SG-IN" -> null
      - owner_id               = "743794601996" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "app-1-asg-lb-sg"
        } -> null
      - tags_all               = {
          - "Name" = "app-1-asg-lb-sg"
        } -> null
      - vpc_id                 = "vpc-05fd8fb92d2545f6d" -> null
    }

  # aws_security_group.ec2_security_group will be destroyed
  # (because aws_security_group.ec2_security_group is not in configuration)
  - resource "aws_security_group" "ec2_security_group" {
      - arn                    = "arn:aws:ec2:us-east-2:743794601996:security-group/sg-01c77c00bd0cb8eff" -> null
      - description            = "Allow inbound and outbound traffic to EC2 instances from load balancer security group" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-01c77c00bd0cb8eff" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = ""
              - from_port        = 80
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-029d54e0d848241ee",
                ]
              - self             = false
              - to_port          = 80
            },
        ] -> null
      - name                   = "Instance-SG" -> null
      - owner_id               = "743794601996" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name" = "app-1-instance-sg"
        } -> null
      - tags_all               = {
          - "Name" = "app-1-instance-sg"
        } -> null
      - vpc_id                 = "vpc-05fd8fb92d2545f6d" -> null
    }

  # aws_security_group.http-sg will be created
  + resource "aws_security_group" "http-sg" {
      + arn                    = (known after apply)
      + description            = "allow inbound http traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "from my ip range"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "allow_http_access"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Application-1-sg"
        }
      + tags_all               = {
          + "Name" = "Application-1-sg"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private[0] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-095187fc19e4faf22" -> (known after apply)
      ~ availability_zone_id                           = "use2-az1" -> (known after apply)
      ~ cidr_block                                     = "10.20.20.0/27" -> "10.20.20.0/28" # forces replacement
      ~ id                                             = "subnet-095187fc19e4faf22" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "743794601996" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "app-1-private-1" -> "Application-1-private"
        }
      ~ tags_all                                       = {
          ~ "Name" = "app-1-private-1" -> "Application-1-private"
        }
      ~ vpc_id                                         = "vpc-05fd8fb92d2545f6d" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_subnet.private[1] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-0bc3d45b2068a556a" -> (known after apply)
      ~ availability_zone_id                           = "use2-az2" -> (known after apply)
      ~ cidr_block                                     = "10.20.20.32/27" -> "10.20.20.16/28" # forces replacement
      ~ id                                             = "subnet-0bc3d45b2068a556a" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "743794601996" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "app-1-private-2" -> "Application-1-private"
        }
      ~ tags_all                                       = {
          ~ "Name" = "app-1-private-2" -> "Application-1-private"
        }
      ~ vpc_id                                         = "vpc-05fd8fb92d2545f6d" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_subnet.private[2] must be replaced
-/+ resource "aws_subnet" "private" {
      ~ arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-05de33583a52d0de4" -> (known after apply)
      ~ availability_zone_id                           = "use2-az3" -> (known after apply)
      ~ cidr_block                                     = "10.20.20.64/27" -> "10.20.20.32/28" # forces replacement
      ~ id                                             = "subnet-05de33583a52d0de4" -> (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      - map_customer_owned_ip_on_launch                = false -> null
      ~ owner_id                                       = "743794601996" -> (known after apply)
      ~ private_dns_hostname_type_on_launch            = "ip-name" -> (known after apply)
      ~ tags                                           = {
          ~ "Name" = "app-1-private-3" -> "Application-1-private"
        }
      ~ tags_all                                       = {
          ~ "Name" = "app-1-private-3" -> "Application-1-private"
        }
      ~ vpc_id                                         = "vpc-05fd8fb92d2545f6d" # forces replacement -> (known after apply) # forces replacement
        # (7 unchanged attributes hidden)
    }

  # aws_subnet.public[0] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-029ccaae27cefcf15" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2a" -> null
      - availability_zone_id                           = "use2-az1" -> null
      - cidr_block                                     = "10.20.20.96/27" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-029ccaae27cefcf15" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "743794601996" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "app-1-public-1"
        } -> null
      - tags_all                                       = {
          - "Name" = "app-1-public-1"
        } -> null
      - vpc_id                                         = "vpc-05fd8fb92d2545f6d" -> null
    }

  # aws_subnet.public[1] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-0ebb12f7380a42c96" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2b" -> null
      - availability_zone_id                           = "use2-az2" -> null
      - cidr_block                                     = "10.20.20.128/27" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-0ebb12f7380a42c96" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "743794601996" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "app-1-public-2"
        } -> null
      - tags_all                                       = {
          - "Name" = "app-1-public-2"
        } -> null
      - vpc_id                                         = "vpc-05fd8fb92d2545f6d" -> null
    }

  # aws_subnet.public[2] will be destroyed
  # (because aws_subnet.public is not in configuration)
  - resource "aws_subnet" "public" {
      - arn                                            = "arn:aws:ec2:us-east-2:743794601996:subnet/subnet-04d0a13df56589d20" -> null
      - assign_ipv6_address_on_creation                = false -> null
      - availability_zone                              = "us-east-2c" -> null
      - availability_zone_id                           = "use2-az3" -> null
      - cidr_block                                     = "10.20.20.160/27" -> null
      - enable_dns64                                   = false -> null
      - enable_resource_name_dns_a_record_on_launch    = false -> null
      - enable_resource_name_dns_aaaa_record_on_launch = false -> null
      - id                                             = "subnet-04d0a13df56589d20" -> null
      - ipv6_native                                    = false -> null
      - map_customer_owned_ip_on_launch                = false -> null
      - map_public_ip_on_launch                        = false -> null
      - owner_id                                       = "743794601996" -> null
      - private_dns_hostname_type_on_launch            = "ip-name" -> null
      - tags                                           = {
          - "Name" = "app-1-public-3"
        } -> null
      - tags_all                                       = {
          - "Name" = "app-1-public-3"
        } -> null
      - vpc_id                                         = "vpc-05fd8fb92d2545f6d" -> null
    }

  # aws_vpc.this must be replaced
-/+ resource "aws_vpc" "this" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:743794601996:vpc/vpc-05fd8fb92d2545f6d" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.20.20.0/24" -> "10.20.20.0/26" # forces replacement
      ~ default_network_acl_id               = "acl-0cdbe95aa5fa03918" -> (known after apply)
      ~ default_route_table_id               = "rtb-0bc46cb36d22ac532" -> (known after apply)
      ~ default_security_group_id            = "sg-0d015a258cbbe1cf5" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-004ba8a36aaf520f6" -> (known after apply)
      ~ enable_classiclink                   = false -> (known after apply)
      ~ enable_classiclink_dns_support       = false -> (known after apply)
      ~ id                                   = "vpc-05fd8fb92d2545f6d" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-0bc46cb36d22ac532" -> (known after apply)
      ~ owner_id                             = "743794601996" -> (known after apply)
      ~ tags                                 = {
          ~ "Name" = "app-1" -> "Application-1"
        }
      ~ tags_all                             = {
          ~ "Name" = "app-1" -> "Application-1"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 19 to add, 3 to change, 35 to destroy.

Changes to Outputs:
  + instance_app-server_public_dns = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + load_balancer_dns_name         = "front-1592036984.us-east-2.elb.amazonaws.com"

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kunduso, Action: `pull_request`*